<?php
if (!defined('APP_CONFIG')) {

    /*------------------------------------------------------------------------------------------------------------*/

    switch (strpos(__DIR__, "dev")) {       
        case true:// Development mode
            /*------------------------------------------------------------------------------------------------------------*/
            /*------------------------------------------------------------------------------------------------------------*/
            break;
        case false:// Production mode
            /*------------------------------------------------------------------------------------------------------------*/
            /*------------------------------------------------------------------------------------------------------------*/
            break;
        default:
            break;
    }

    /*------------------------------------------------------------------------------------------------------------*/

    /**
     * VHCL_BITRIX_DEPARTMENT_PARENT_LIST
     * Список подразделений, являющимися родительскими для других подразделений
     * 1 - главное подразделение компании Kilem Khan
     * 57 - магазины
     * 58 - склады
     * 59 - офис
     */

    $APP_CONFIG['VHCL_BITRIX_DEPARTMENT_PARENT_LIST'] = [1, 57, 58, 59];

    /**
     * HR_BITRIX_PHONE_FIELD_LIST
     * список полей для доступа к телефонам сотрудников
     */
    $APP_CONFIG['HR_BITRIX_PHONE_FIELD_LIST'] = ['PERSONAL_PHONE', 'PERSONAL_MOBILE', 'WORK_PHONE'];

    /*------------------------------------------------------------------------------------------------------------*/

    $APP_CONFIG['VHCL_COMPANY_NAME'] = 'Сфера энергии';

    $APP_CONFIG['VHCL_COMPANY_DIRECTOR_title'] = 'Ильясов Ж.К.';

    /*------------------------------------------------------------------------------------------------------------*/
    define('APP_CONFIG', $APP_CONFIG);
}